Revit 2025 API
BuiltInFailures.NumberingFailures Class
 Failures related to object numbering operations.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.NumberingFailures
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static class NumberingFailures
Public NotInheritable Class NumberingFailures
public ref class NumberingFailures abstract sealed
[<AbstractClassAttribute>]
[<SealedAttribute>]
type NumberingFailures = class end
The BuiltInFailures.NumberingFailures type exposes the following members.
Properties
Name | Description
SampleNumberingError |  Replace this with the first real one
Top
See Also
Reference
Autodesk.Revit.DB Namespace